app/views/users/write_create.html.erb

        <%= image_tag("chichi", size: "100") %>
        <%= form.radio_button :recorder_id, Recorder.find_by(name: "ちち").id %>
---
SELECT "recorders".* FROM "recorders" WHERE "recorders"."name" = ? LIMIT ?  [["name", "ちち"], ["LIMIT", 1]]

        <%= image_tag("otouto", size: "100") %>
        <%= form.radio_button :recorder_id, Recorder.find_by(name: "おとうと").id %>
---
SELECT "recorders".* FROM "recorders" WHERE "recorders"."name" = ? LIMIT ?  [["name", "おとうと"], ["LIMIT", 1]]

        <%= image_tag("sohu", size: "100") %>
        <%= form.radio_button :recorder_id, Recorder.find_by(name: "そふ").id %>
---
SELECT "recorders".* FROM "recorders" WHERE "recorders"."name" = ? LIMIT ?  [["name", "そふ"], ["LIMIT", 1]]

        <%= image_tag("imouto", size: "100") %>
        <%= form.radio_button :recorder_id, Recorder.find_by(name: "いもうと").id %>
---
SELECT "recorders".* FROM "recorders" WHERE "recorders"."name" = ? LIMIT ?  [["name", "はは"], ["LIMIT", 1]]

        <%= image_tag("haha", size: "100") %>
        <%= form.radio_button :recorder_id, Recorder.find_by(name: "はは").id %>
---
SELECT "recorders".* FROM "recorders" WHERE "recorders"."name" = ? LIMIT ?  [["name", "そぼ"], ["LIMIT", 1]]

        <%= image_tag("sobo", size: "100") %>
        <%= form.radio_button :recorder_id, Recorder.find_by(name: "そぼ").id %>
---
SELECT "recorders".* FROM "recorders" WHERE "recorders"."name" = ? LIMIT ?  [["name", "そぼ"], ["LIMIT", 1]]

      <%= image_tag("cha", size: "100") %>
      <%= form.radio_button :flight_category_id, FlightCategory.find_by(color: "ちゃいろ").id %>
---
SELECT "flight_categories".* FROM "flight_categories" WHERE "flight_categories"."color" = ? LIMIT ?  [["color", "ぴんく"], ["LIMIT", 1]]

      <%= image_tag("green", size: "100") %>
      <%= form.radio_button :flight_category_id, FlightCategory.find_by(color: "みどりいろ").id %>
---
SELECT "flight_categories".* FROM "flight_categories" WHERE "flight_categories"."color" = ? LIMIT ?  [["color", "きいろ"], ["LIMIT", 1]]

      <%= image_tag("ao", size: "100") %>
      <%= form.radio_button :flight_category_id, FlightCategory.find_by(color: "あお").id %>
---
SELECT "flight_categories".* FROM "flight_categories" WHERE "flight_categories"."color" = ? LIMIT ?  [["color", "むらさき"], ["LIMIT", 1]]

      <%= image_tag("pink", size: "100") %>
      <%= form.radio_button :flight_category_id, FlightCategory.find_by(color: "ぴんく").id %>
---
SELECT "flight_categories".* FROM "flight_categories" WHERE "flight_categories"."color" = ? LIMIT ?  [["color", "ぴんく"], ["LIMIT", 1]]

      <%= image_tag("yellow", size: "100") %>
      <%= form.radio_button :flight_category_id, FlightCategory.find_by(color: "きいろ").id %>
---
SELECT "flight_categories".* FROM "flight_categories" WHERE "flight_categories"."color" = ? LIMIT ?  [["color", "きいろ"], ["LIMIT", 1]]

      <%= image_tag("murasaki", size: "100") %>
      <%= form.radio_button :flight_category_id, FlightCategory.find_by(color: "むらさき").id %>
---
SELECT "flight_categories".* FROM "flight_categories" WHERE "flight_categories"."color" = ? LIMIT ?  [["color", "むらさき"], ["LIMIT", 1]]