app/views/users/write_create.html.erb

        <%= image_tag("cha", size: "100") %>
        <%= form.radio_button :flight_category_id, FlightCategory.find_by(color: "ちゃいろ").id %>
---
SELECT "flight_categories".* FROM "flight_categories" WHERE "flight_categories"."color" = ? LIMIT ?  [["color", "ちゃいろ"], ["LIMIT", 1]]