app/controllers/password_resets_controller.rb

SELECT "users".* FROM "users" WHERE "users"."reset_password_token" = 'kVkaTzF7r-DKhTSsNVy6' ORDER BY "users"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
  def edit
    @token = params[:id]
    @user = User.load_from_reset_password_token(params[:id])
    not_authenticated if @user.blank?

SELECT 1 AS one FROM "users" WHERE "users"."reset_password_token" = ? AND "users"."id" != ? LIMIT ?  [["reset_password_token", "sG9aPU64ysK2P-Ws8bMb"], ["id", 10], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."reset_password_token" = '5bGWvoAjyVpLiM4ro57F' ORDER BY "users"."id" ASC LIMIT ?  [["LIMIT", 1]]
UPDATE "users" SET "crypted_password" = ?, "salt" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["crypted_password", "$2a$10$ShGQ1Vz9DJM/LtmxYSBqNOMnKvvycb5ls/2QGKAH4qjMgkq1rvFhu"], ["salt", "CJsv2QydyyS6vWx9iVRb"], ["updated_at", "2024-10-08 01:33:17.085404"], ["id", 10]]
---
  def update
    @token = params[:id]
    @user = User.load_from_reset_password_token(params[:id])

    if @user.blank?
      not_authenticated
      return
    end


    if @user.update(password: params[:user][:password])