app/controllers/records_controller.rb

INSERT INTO "records" ("user_id", "breastmilk_amount", "has_urinated", "flight_category_id", "remarks", "recorder_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"
---
    def create
      Rails.logger.debug(params.inspect)
      @record = Record.new(record_params)

      if @record.save

SELECT "records".* FROM "records" WHERE "records"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "records" WHERE "records"."id" = ?  [["id", 1]]
---
    def show
      @record = Record.find(params[:id])
      @record.destroy