app/controllers/users_controller.rb

  def create
    puts params.inspect
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("email", "crypted_password", "salt", "name", "created_at", "updated_at", "password_digest", "reset_password_token", "reset_password_token_expires_at", "reset_password_email_sent_at", "access_count_to_reset_password_page") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"

  def page
    @user = User.find_by(id: session[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 14], ["LIMIT", 1]]

  def show
    @user = User.find_by(id: params[:id])
    @record = Record.all
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 14], ["LIMIT", 1]]
SELECT "records".* FROM "records"